In [1]:
print('start')

start

In [7]:
import pandas as pd

info = {
    'Name':['Joe doe','Moye eyuy','Sebastian agyte'],
    'Prefix':['Dr.','Dr.','Er.'],
    'Email':['doe@joe.com','eyuy@moye.com','agyte@sebastian.com']
}
df=pd.DataFrame(info)
df

              Name Prefix                Email
0          Joe doe    Dr.          doe@joe.com
1        Moye eyuy    Dr.        eyuy@moye.com
2  Sebastian agyte    Er.  agyte@sebastian.com

## Conditional Formatting

In [10]:
filter=df['Prefix']=='Dr.' #These formating return the boolean value : True if the value is present : False if the value is absent
filter

0     True
1     True
2    False
Name: Prefix, dtype: bool

In [11]:
df[filter] #able to get all details that shared same prefix which is Dr.

        Name Prefix          Email
0    Joe doe    Dr.    doe@joe.com
1  Moye eyuy    Dr.  eyuy@moye.com

In [13]:
df.loc[filter,'Name'] # Any columns can be acess using loc/iloc

0      Joe doe
1    Moye eyuy
Name: Name, dtype: object

In [15]:
filter1= (df['Prefix'] == 'Dr.') & (df['Name'] == 'Joe doe') #Being specific is allowed 
filter1

0     True
1    False
2    False
dtype: bool

In [19]:
df.loc[filter1,'Name'] # we are getting only one value

0    Joe doe
Name: Name, dtype: object

**Use cases of Filtering**

In [20]:
data = {
    'Respondent_id':[23,32,21,13,54],
    'Salary':[12000,34000,45000,12300,1230],
    'Lang':['Java/r/assembly','Python/R/Java','C++/c','Go','Y-MAP'],
    'Country':['NortH Korea','China','Taiwan','Russia','Ukraine']

}
beta=pd.DataFrame(data)
beta

   Respondent_id  Salary             Lang      Country
0             23   12000  Java/r/assembly  NortH Korea
1             32   34000    Python/R/Java        China
2             21   45000            C++/c       Taiwan
3             13   12300               Go       Russia
4             54    1230            Y-MAP      Ukraine

In [26]:
# Filtering data over salary
high_salary=beta['Salary'] > 12400 # Salary is > 12400
high_salary

0    False
1     True
2     True
3    False
4    False
Name: Salary, dtype: bool

In [28]:
beta.loc[high_salary,['Respondent_id','Lang','Country']] # Only two id have a salary more than 12400

   Respondent_id           Lang Country
1             32  Python/R/Java   China
2             21          C++/c  Taiwan

In [34]:
# Selecting the id with lang is java
info=['Respondent_id','Lang','Country']
lang_work=beta['Lang'].str.contains('Java',na=False)
lang_work

0     True
1     True
2    False
3    False
4    False
Name: Lang, dtype: bool

In [35]:
beta.loc[lang_work,info] #Only two users use java as programming lang

   Respondent_id             Lang      Country
0             23  Java/r/assembly  NortH Korea
1             32    Python/R/Java        China

**Advanced query method**

In [37]:
beta.query('Salary > 12300') # BASICALLY WRITTING A CONDITION INSIDE THE QUERY beta.query('Your_conditions)

   Respondent_id  Salary           Lang Country
1             32   34000  Python/R/Java   China
2             21   45000          C++/c  Taiwan